Merge pull request #25 from Aizen93/develop
Contains:

Custom Roles & Permissions
Channel Permission Overrides
Permission Calculator
Voice Moderation
Per-Server Nicknames
UI/UX Improvements
Route Guard Migration
Security Hardening
Database Changes : New models
Testing: Added a new pnpm test command for Unit tests
Community Theme : Creating custom themes, live preview mode, marketplace
Private STUN server for P2P by coturn
